app/views/orders/edit.html.slim

SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = ?  [["order_id", 1]]
---
          tbody.show-cart
            -if @order.line_items.present?