app/views/orders/show.html.slim

      #product-container.container-fluid
        -if @order.line_items.present?
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = ?  [["order_id", 1]]