app/controllers/orders_controller.rb

	def create
		@order = Order.new(order_params)
		if @order.save
---
INSERT INTO "orders" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-09-18 09:06:33.323792"], ["updated_at", "2020-09-18 09:06:33.323792"]]

	def edit
		@products = Product.all
---
SELECT "products".* FROM "products"

	def update
		if @order.update(order_params)
---
UPDATE "orders" SET "state" = ?, "total" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["state", "NEW"], ["total", 48.65], ["updated_at", "2020-09-18 09:09:47.616035"], ["id", 1]]

	def complete_order
		if @order.update(state: "COMPLETED")
---
UPDATE "orders" SET "state" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["state", "COMPLETED"], ["updated_at", "2020-09-18 09:12:32.467576"], ["id", 3]]

		def set_order
			@order = Order.find(params[:id] || params[:order_id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]