app/controllers/products_controller.rb

	def add_product
		@product = Product.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]