app/models/order.rb

	def promotion_on_chair order
		product = Product.find_by_name('Lavender heart') # find out promotion chair
		return order.line_items.where(product_id: product.id).sum(:quantity) >= 2 # quantity is more than 2 for the Cheapest chair
---
SELECT "products".* FROM "products" WHERE "products"."name" = ? LIMIT ?  [["name", "Very Cheap Chair"], ["LIMIT", 1]]
SELECT SUM("line_items"."quantity") FROM "line_items" WHERE "line_items"."order_id" = ? AND "line_items"."product_id" = ?  [["order_id", 1], ["product_id", 1]]