app/views/products/index.html.slim

SELECT "products".* FROM "products"
---
javascript:
  $('.add-product').on('click', function(){
    var quantity = $(this).closest('div').find('.quantity').val();
    var productId =  $(this).attr('product-id')
    $(this).attr('href',"/products/"+productId+"/add_product?quantity="+quantity) // update href to send quantity with params
  })